# 什么是 ZK Rollup

ZK Rollup作为一种以太坊的扩容方式，它允许交易在链下进行处理，并在主链上以单个压缩交易的形式合并。这个过程提高了交易吞吐量，降低了交易成本，通过零知识证明而保证状态的有效性，提高主链的隐私性和安全性。因此，ZK Rollup被认为是以太坊扩容的终极解决方案。

但目前零知识证明生成需要较大的算力，技术难度也更高，同时由于以太坊虚拟机（EVM）不设计支持 ZK 电路，无法直接执行智能合约。为了解决这个问题，许多开发者尝试开发zkEVM，它可以以与零知识证明计算兼容的方式运行智能合约。对于许多ZK Rollup来说，实现EVM等价意味着实现了完整的字节码级兼容性，目前来看，zkEVM是以太坊扩容的关键。本文将研究五种常见的zkEVM类型及各类型项目进展，并指出各类型zkEVM 在设计上的挑战。

什么是zkEVM

zkEVM 是一个支持零知识证明计算的 EVM 兼容的虚拟机，它是一种基于以太坊区块链技术的应用程序开发平台。可以将EVM合约在无需修改的情况下直接部署运行，同时程序的运行可以通过零知识证明其计算的有效性。

zkEVM的优势

1.zkEVM提高兼容性。zkEVM与为在 EVM 中运行而编写的智能合约高度兼容，可以与 EVM 基础设施无缝集成，开发者无需重新开发应用就可以将现有的以太坊应用程序迁移到 L2上，同时zk proof继承了以太坊网络安全性。

2.zkEVM增强可扩展性。zkEVM 使用的是非交互式证明，提高了吞吐量，减少了延迟，因为验证 L2 区块的证明比重新执行新提议的区块中的每个交易更快。

3.zkEVM降低存储成本。zkEVM Rollup可以选择只在以太坊 L1 上发布对其最终状态的承诺，从而减少链上存储成本。有效性证明保证了 zkEVM 新状态的正确性，因此排序器不必发布重新执行状态转换更改所需的所有数据。

正是随着对zkEVM的不断改进，ZK Rollup的限制得到解决，利用ZK Rollup的安全性和效率，加之EVM的兼容性，应用程序可以与智能合约进行交互，改进应用程序体验。
